[    
    {
        "subject": "תחקיר סגירת נתבג", "subjectPic": "D:/Ori-Studies/miLab/Lab/project/FlipSide/server/pictures/airport_closing_topic_pic.jpg", "News" :[
            {
                "title": "מירי רגב: נחפש מתווה חדש לנתבג. בני גנץ: שיקולים פוליטיים",
                "webName": "סרוגים",
                "summary": "הסערה סביב אישורי הכניסה לארץ שמתירה ועדת ההיתרים ממשיכה להסעיר את המערכת הפוליטית. כחול לבן: נדרוש לדון מחר כדי לוודא ששרים לא מקבלים החלטות משיקולים פוליטיים",
                "link": "http://www.srugim.co.il/540937-%D7%A8%D7%92%D7%91-%D7%A0%D7%97%D7%A4%D7%A9-%D7%9E%D7%AA%D7%95%D7%95%D7%94-%D7%9C%D7%A0%D7%AA%D7%91%D7%92-%D7%92%D7%A0%D7%A5-%D7%94%D7%A9%D7%99%D7%A7%D7%95%D7%9C%D7%99%D7%9D-%D7%A4%D7%95%D7%9C"
            },
            {
                "title": "תחקיר מביש שמעליב את העיתונות",
                "webName": "ישראל היום",
                "summary": "הבחירות יתקיימו בעוד קצת יותר משלושה שבועות, אבל כבר כעת נראה שברית השותפים לשנת 2021 – הכולל את חברי הכנסת יאיר לפיד ואביגדור ליברמן ואת יושב ראש תקווה חדשה גדעון סער – מובילה את סדר היום, שמתעסק בעיקר בהתקהלויות חרדים ובכמות חברי הקהילה שחוזרים ארצה בטיסות חילוץ. כשסדר היום הוא על הקורונה, אמר הפרשן הפוליטי של ישראל היום מתי טוכפלד לברדוגו, בצד השמאלי של המפה הפוליטית החליטו לייצר קמפיין אנטי-חרדי, למרות שנתוני ההתחסנות והתחלואה במגזר הערבי גבוהים יותר שם." ,
                "link": "https://www.israelhayom.co.il/article/856221"
            },
            {
                "title": "מחדל סגירת השמים: מאעכרים, קומבינות ופרוטקציות כדי להיכנס לישראל",
                "webName": "mako",
                "summary": "כך סגרו לכם את השמיים - ופתחו לאחרים: הטיפול בסגירת השמיים הוא אולי התמצית של כל מה שרע בניהול משבר הקורונה. טיסה אחרת נחתה מארצות הברית והתברר ש-11 מהנוסעים עליה מאומתים לקורונה, כולם חרדים, ואחת הנוסעות סיפרה ששמעה אותם מתגאים שהשיגו אישורים מזויפים: היו שם חבורות של גברים שלא דאגו להסתיר את זה שהם לא עשו בדיקת קורונה, או שעשו וזו לא התשובה שמופיעה במכתב. עד כמה זה נפוץ? אבל נוסע מטיסה אחרת הסביר לנו עד כמה זה לא מסובך: הם רוצים תעודת שלילי וכולם זייפו שם, לא עלו על אף אחד וזה לא מעניין אותם בכלל. היו חלק שעלו עליהם, בטיסה שלנו אף אחד לא עלה עלינו, כי לא הכניסו את זה למכשיר, רק הסתכלו על זה שזה נראה נורמלי. נוסע אחר סיפר: הבת שלי לפני איזה שבועיים הגיעה מקייב ולא נתנו לה שום דבר. אדם שנחת בנתבג ביום שני בערב סיפר: שלחתי לוועדה מכתב מרופא מאמריקה, ככה וככה פרטים, אבל גם ככה הם פשוט לא הסתכלו על זה.",
                "link": "https://www.mako.co.il/news-israel/2021_q1/Article-aacf52ab77fd771027.htm"
            },
            {
                "title": "מה הסיפור של נתניהו עם טיסות?",
                "webName": "The Marker",
                "summary": "אי אפשר שלא להתמקד באחד הכשלונות הגדולים והמתמשכים של נתניהו - השליטה על השמיים ועל נתבג. אולי זה בגלל האהבה שלו לטיסות ולשהות מעבר לים - אהבה שלא מומשה בשנה האחרונה (המטוס הפרטי עדיין לא טס, ואפילו טיסת בחירות לאמירויות בוטלה לו), ואולי בגלל אינטרסים זרים - כניעה לחבר מאמריקה (טראמפ) ולחברים מפה (החרדים) והלחץ לשווק לישראלים את השלום עם דובאי. נתניהו לא רק נכשל בשלבים ראשונים של הקורונה - הוא גם לא למד לתקן, והכאוס והזיגזג בהחלטות חזרו על עצמם, כך שלישראל נכנסו אלפי חולי קורונה רגילים, ועליהם נוספו בחודשים האחרונים המוטציות הבריטית והדרום אפריקאית החדשות (ומי יודע איזה עוד). לפני שבועיים, בגלל הביקורת שגברה ובגלל קצת סאטירה, החליטה הממשלה לסגור הרמטית את נתבג - אין יוצא ואין בא.",
                "link": "https://www.themarker.com/news/internal-info/1.9539736"
            }
        ]
    },
    {
        "subject": "פרשת שר הפנים דרעי", "subjectPic": "D:/Ori-Studies/miLab/Lab/project/FlipSide/server/pictures/arie_deryi_topic_pic.jpg", "News" :[
            {
                "title": "דרעי: מודה לבורא עולם על ביטול האישומים השקריים נגדי",
                "webName": "בחדרי חרדים",
                "summary": "יושב ראש שס, השר אריה דרעי, התייחס הצהריים (שישי) להחלטת היועץ המשפטי לממשלה, אביחי מנדלבליט, להגיש נגדו כתב אישום בעבירות מס: מודה לבורא עולם על ההחלטה לבטל את כל האישומים השקריים נגדי. לדברי דרעי: לאחר למעלה מ-5 שנות חקירה קשות, אני מודה לבורא עולם על ההחלטה לבטל את כל האישומים השקריים נגדי ומשוכנע כי בשימוע יוחלט גם על סגירת התיק בעניין עברות המס, לאחר שכל העובדות יוצגו בפני היועץ המשפטי. דרעי הוסיף: ‏אני מתכוון להמשיך להתמקד בתפקידי כשר הפנים והדאגה לחלשים שזקוקים לסיוע, בעיקר בתקופת הקורונה ושמירה על זהותה היהודית של המדינה. מוקדם יותר היום הודיע היועץ המשפטי לממשלה, אביחי מנדלבליט, לפרקליטו של יושב ראש שס, השר אריה דרעי, כי החליט להגיש נגדו כתב אישום בגין עבירות מס, וזה בכפוף לשימוע",
                "link": "https://www.kikar.co.il/382820.html"
            },
            {
                "title": "עורך דין אורי קורב על תיק דרעי: ההר הוליד עכבר",
                "webName": "כיכר השבת",
                "summary": "עורך דין קורב הוסיף: כמי שנחשף לחומר באחת הפרשיות אני חושב שמדובר בפרשיה חלשה ביותר שאני לא חושב שיש בה ראיות להעמדה לדין בעבירות מס, ולכן אם זה המצב גם בשאר הפרשיות, הייתי אומר שלשר דרעי יש סיכוי בשימוע לשכנע ולכרסם בכתב החשדות.",
                "link": "https://www.kikar.co.il/383181.html"
            },
            {
                "title": "עבירות מס במקום שוחד: דרעי יואשם בכפוף לשימוע",
                "webName": "כלכליסט",
                "summary": "היועץ המשפטי אביחי מנדלבליט הודיע לסנגורים של שר הפנים כי החליט להאשימו בכפוף לשימוע בשלוש עבירות מס - קבלת הכנסות ללא דיווח ומכירת נכס בגבעת שאול. דרעי, שנחשד בתחילה בשוחד, לא יואשם גם במרמה ובהפרת אמונים",
                "link": "https://www.calcalist.co.il/local/articles/0,7340,L-3886510,00.html"
            },
            {
                "title": "סופן של עבירות המס המיוחסות לאריה דרעי - מאסר",
                "webName": "The Marker",
                "summary": "מנדלבליט הכניס לתמונה את המשנה ליועץ לעניינים פליליים, עורך דין עמית מררי, כדי שתבחן את הסוגיות העולות במבט טרי. כמו בתיקי נתניהו, גם במקרה של דרעי התוצאה של מנדלבליט היא החלטה על כתב אישום בכפוף לשימוע בעבירות רזות בהרבה מכפי שהיו בתיק בתחילת הדרך. ורפאלי הבת הורשעה בעבירות של מסירת ידיעות לא נכונות ללא הצדק סביר. בבוא העת, יצטרך היועץ מנדלבליט להכריע אם עבירות המס מונעות מהשר דרעי להמשיך לכהן כשר בהתאם להלכות דרעי ופנחסי, שנקבעו בשעתו בבגץ בעקבות סירובו של ראש המשלה המנוח, יצחק רבין, לפטר את דרעי מתפקידו כשר הפנים - לאחר שהיועץ המשפטי לממשלה דאז, יוסף חריש, החליט להגיש נגד דרעי כתב אישום בעבירות שוחד. השאלה אם דרעי יוכל להמשיך לכהן כשר תלויה גם בחומרת העבירה ובמאפייניה",
                "link": "https://www.themarker.com/law/1.9435313"
            }
        ]
    },
    {
        "subject": "מותו של אהוביה סנדק", "subjectPic": "D:/Ori-Studies/miLab/Lab/project/FlipSide/server/pictures/hahuvya_topic_pic.jpg", "News" :[
            {
                "title": "זה כמעט נגמר באסון: שוטר מעיף מפגין על רכב נוסע",
                "webName": "סרוגים",
                "summary": "בשלב מסוים, תפס השוטר את אחד הצעירים והעיף אותו אחורה, כשהוא לא שם לב שבאותו הזמן נוסע רכב מאחוריו. מהמשטרה נמסר: כוחות המשטרה ממשיכים בפעילות אל מול מאות משתתפי המחאה סמוך לגשר המיתרים תוך ניסיונותיהם של המפגינים מעת לעת לחסום את הכניסה לעיר. עד כה עוכבו 10 מפגינים שהפרו את הסדר וניסו לחסום את ציר התנועה.",
                "link": "https://www.srugim.co.il/522514-%D7%96%D7%94-%D7%9B%D7%9E%D7%A2%D7%98-%D7%A0%D7%92%D7%9E%D7%A8-%D7%91%D7%90%D7%A1%D7%95%D7%9F-%D7%A9%D7%95%D7%98%D7%A8-%D7%9E%D7%A2%D7%99%D7%A3-%D7%A6%D7%A2%D7%99%D7%A8-%D7%A2%D7%9C-%D7%A8%D7%9B"
            },
            {
                "title": "מפגינים על מות אהוביה סנדק תועדו מכים שוטרים בירושלים: תשרפו אותם",
                "webName": "וואלה",
                "summary": "במסגרת המחאה המתרחשת על מות הנער במרדף משטרתי, חסמו מפגינים צמתים לאורך כביש 60 ביהודה ושומרון, שם התקבלו גם דיווחים על אלימות כלפי פלסטינים. בסרטון שהופץ ברשתות החברתיות הם נראים בועטים בבלשי משטרה שכובים על הקרקע, וקוראים תרצחו אותם ואבנים. 29 מפגינים נעצרו",
                "link": "https://news.walla.co.il/item/3408316"
            },
            {
                "title": "תיעוד חריג: מפגינים מכים שוטרים סמויים במחאה בירושלים",
                "webName": "ynet",
                "summary": "המחאה על מות נער הגבעות אהוביה סנדק במהלך מרדף משטרתי נמשכת, ומאות הפגינו בבירה. שני שוטרים נפצעו וניידת הושחתה, 39 נעצרו. בתקרית חריגה ניסו מפגינים לסכל מעצר של חברם בסמטה צדדית, והכו את הבלשים הסמויים. אחד מהם צעק: תפתחו אותם!",
                "link": "https://www.ynet.co.il/news/article/rJ1GSWt6P"
            },
            {
                "title": "המחאה על מותו של אהוביה סנדק: מפגינים תקפו שוטרים, 34 נעצרו",
                "webName": "מעריב",
                "summary": "מאות בני אדם מחו בירושלים על מותו של נער הגבעות אהוביה סנדק, שמצא את מותו במהלך מרדף משטרתי. במהלך מעצר של אחד המפגינים תקפו המוחים את אחד הבלשים.",
                "link": "https://www.maariv.co.il/news/law/Article-811727"
            }
        ]
    },
    {
        "subject": "הבמאי לשחקנית גל גדות", "subjectPic": "D:/Ori-Studies/miLab/Lab/project/FlipSide/server/pictures/gal_gadot_topic_pic.jpg", "News" :[
            {
                "title": "ג'וס ווידן איים לפגוע בקריירה של גל גדות בצילומי ליגת הצדק",
                "webName": "mako",
                "summary": "גורמים שהיו נוכחים על הסט של ליגת הצדק אמרו להוליווד ריפורטר כי הבמאי ג'וס ווידון איים שיפגע בקריירה של גל גדות והכריח אותה להקריא טקסטים שהיא התנגדה להם. לפני כמה חודשים נפתחה חקירה בוורנר מדיה בעקבות טענות שווידון התנהג בצורה לא נאותה לאנשי הצוות והשחקנים",
                "link": "https://www.mako.co.il/culture-movies/Article-a699fd37808a871027.htm"
            },
            {
                "title": "במאי סרט ליגת הצדק התבטא באופן מעליב מול גל גדות: נמאס לי ממנה, היא צריכה לשתוק",
                "webName": "HE NEWS",
                "summary": "לאחרונה נחשפה התנהגותו הבלתי הולמת של הבמאי ג׳וס ווידון, כלפי השחקנית הישראלית והבינלאומית גל גדות, זאת בזמן שביים אותה במהלך הסרט ליגת הצדק. גורם החשיפה? השחקן ריי פישר",
                "link": "https://hebrewnews.com/article/39486"
            },
            {
                "title": "ליגה ללא צדק: האם הבמאי של הסרט התעלל בגל גדות",
                "webName": "סרוגים",
                "summary": "וונדר וומן עוברת קשיים כמו כל אחד אחר, כך מסתבר בימים האחרונים עם פרסומים כי הבמאי ג'וס ווידון התייחס בצורה שאינה נאותה לשחקנית גל גדות על סט הצילומים של הסרט ליגת הצדק בו השתתפה בשנת 2017. הדבר יצא כבר לפני כשנה כאשר התפרסם כי אולפני וורנר חוקרים את הבמאי על התנהגותו ואף הזמינו את השחקנית לחקירה, אך כעת עם עליית הגרסה החדשה של 'ליגת הצדק' הסיפור עולה שוב עם פרטים נוספים שמעיבים על החלום ההוליוודי. בראיון שהתפרסם בהוליווד ריפורטר, השחקן ריי פישר שגילם בסרט את סייבורג, שטח לראשונה טענות נגד ווידון על יחס קשה לשחקנים בינהם הכוכבת הישראלית. המגזין הביא 'עדויות' של גורמים שהיו על הסט וסיפרו כי נראה שלגדות היו השגות בדבר דמותה של דיאנה נסיכת האמזונות שיוצאת יותר תוקפנית בגרסה של ליגת הצדק מאשר בסרט 'וונדר וומן' שהפך את גדות לכוכבת בינלאומית מוערכת.",
                "link": "https://www.srugim.co.il/552075-%D7%9C%D7%99%D7%92%D7%94-%D7%9C%D7%9C%D7%90-%D7%A6%D7%93%D7%A7-%D7%92%D7%95%D7%A1-%D7%95%D7%95%D7%99%D7%93%D7%95%D7%9F-%D7%92%D7%9C-%D7%92%D7%93%D7%95%D7%AA"
            },
            {
                "title": "דרמה בהוליווד: במאי ליגת הצדק איים לפגוע בקריירה של גל גדות",
                "webName": "מעריב",
                "summary": "הוונדרוומן הישראלית, גל גדות, אמנם שומרת על אצילות אין סופית אלא שהצליחה לפי מקורות זרים להיכנס לעימות עם במאי הסרט 'ליגת הצדק', שאיים לפגוע בקריירה שלה",
                "link": "https://tmi.maariv.co.il/celebs-news/Article-832368"
            }
        ]
    }
]